//
//  CategoryPhysExercises.swift
//  NFPCalculate
//
//  Created by EVladimirA on 03.05.2018.
//  Copyright © 2018 Ereskin Vladimir. All rights reserved.
//

import Foundation

struct CategogyParametrsView {
    var agility = ["14": "Прыжок согнув ноги через коня (козла) в ширину",    // ловкость
        "15": "Прыжок ноги врозь через козла в длину",
        "16": "Прыжок ноги врозь через коня в длину",
        "20": "Соскок махом назад на перекладине",
        "21": "Соскок махом вперед на брусьях",
        "22": "Передвижения по узкой опоре (бревну)",
        "30": "Комплекс приемов рукопашного боя без оружия на 8 счетов",
        "31": "Комплекс рукопашного боя с автоматом на 8 счетов",
        "51": "Тройной прыжок с места",
        "63ж": "Прыжок в длину с места",
        "64ж": "Акробатическое упражнение"]
    var force = ["1": "Сгибание и разгибание рук в упоре лежа",   // сила
        "2": "Наклон туловища вперед",
        "4": "Подтягивание на перекладине",
        "5": "Поднимание ног к перекладине",
        "6": "Подъем переворотом на перекладине",
        "7": "Подъем силой на перекладине",
        "8": "Жим штанги лежа",
        "9": "Сгибание и разгибание рук в упоре на брусьях",
        "10": "Угол в упоре на брусьях",
        "11": "Рывок гири",
        "12": "Толчок двух гирь",
        "13": "Толчок двух гирь по длинному циклу",
        "62ж": "Приседание"]
    var speed = ["40": "Бег на 60 м",       // быстрота
        "41": "Бег на 100 м",
        "42": "Челночный бег 10х10 м",
        "57": "Плавание на 100 м в спортивной форме вольным стилем",
        "57а": "Плавание на 50 м",
        "58": "Плавание 100 м в спортивной форме способом брасс",
        "61ж": "Прыжки со скакалкой"]
    var endurance = ["45": "Бег на 1 км",    // выностивость
        "46": "Бег на 3 км",
        "47": "Бег на 5 км",
        "53": "Лыжная гонка на 5 км",
        "54": "Лыжная гонка на 10 км",
        "57б": "Плавание на 500 м (300м)",
        "43": "Бег на 400 м",
        "44": "Челночный бег 4х100м"]
    var militarySkills = ["24": "Обороты на стационарном гимнастическом колесе", // военно-прикладные навыки
        "25": "Обороты вперед и назад на лопинге",
        "26": "Начальный комплекс приемов рукопашного боя (РБ-Н)",
        "27": "Общий комплекс приемов рукопашного боя (РБ-1)",
        "28": "Специальный комплекс приемов РБ-2",
        "29": "Специальный комплекс приемов РБ-3",
        "32,39а": "Контрольное упражнение на ЕПП",
        "32-37": "Специальные контрольные упражнения для ЛС различных в/ч",
        "38": "Преодоление ЕПП в составе подразделения",
        "39,39а": "Бег с преодолением ПП в составе подразделения",
        "48": "Марш-бросок на 5 км",
        "49": "Марш-бросок на 10 км",
        "50": "Бег на 3 км с метанием гранат и стрельбой",
        "52": "Метание гранаты на дальность",
        "55": "Марш на лыжах в составе подразделения на 5 км",
        "56": "Марш на лыжах в составе подразделения на 10 км",
        "59": "Плавание в обмундировании с оружием",
        "60": "Ныряние в длину"]
}
